chiang:0
chun:1
david:2
flat:3
12/f:4
south:5
view:6
garden:7
tin:8
wan:9
aberdeen:10
hong:11
kong:12
tel:13
6206:14
0317:15
e-mail:16
chc813:17
yahoo.com.hk:18
education:19
jan:20
2017:21
present:22
oct:23
institute:24
certified:25
public:26
accountant:27
hkicpa:28
qualified:29
member:30
society:31
trust:32
estate:33
practitioners:34
qualification:35
programme:36
step:37
striving:38
title:39
polytechnic:40
university:41
bba:42
hons:43
major:44
accountancy:45
minor:46
finance:47
gpa:48
3.28:49
second-upper:50
honour:51
career-related:52
experience:53
sep:54
2011:55
jun:56
2015:57
aug:58
2013:59
pricewaterhousecoopers:60
limited:61
position:62
senior:63
tax:64
consultant:65
private:66
client:67
service:68
providing:69
consultation:70
services:71
affluent:72
individuals:73
set:74
maintain:75
fund:76
company:77
structures:78
succession:79
planning:80
attending:81
meetings:82
bankers:83
discuss:84
ad-hoc:85
works:86
restructuring:87
listed:88
companies:89
execution:90
documents:91
leading:92
team:93
members:94
complete:95
due:96
diligence:97
requests:98
banks:99
registered:100
agents:101
trustees:102
regularly:103
liaising:104
inland:105
revenue:106
department:107
stamp:108
share:109
transfer:110
apply:111
duty:112
relief:113
general:114
fiduciary:115
officer:116
assistant:117
preparing:118
full:119
management:120
accounts:121
maintenance:122
bank:123
held:124
structure:125
arranging:126
payment:127
invoices:128
independently:129
secretarial:130
comply:131
regulations:132
jurisdictions:133
e.g:134
bvi:135
cayman:136
islands:137
handling:138
counterparties:139
hlb:140
hodgson:141
impey:142
cheng:143
student:144
trainee:145
performing:146
substantive:147
audit:148
procedures:149
checking:150
analyzing:151
provided:152
clients:153
working:154
papers:155
financial:156
statements:157
2012:158
proficient:159
microsoft:160
office:161
word:162
excel:163
powerpoint:164
native:165
cantonese:166
mandarin:167
speaker/proficient:168
english:169
expected:170
salary:171
hkd35,000:172
simone:173
yao:174
mobile:175
+852:176
6703-4705:177
email:178
simoneyao:179
gmail.com:180
2015-present:181
work:182
asiya:183
investments:184
specializes:185
emerging:186
asia:187
kuwait:188
investment:189
authority:190
research:191
analyst:192
pan-asia:193
consumer:194
industrial:195
tmt:196
+24:197
ytd:198
average:199
return:200
achieved:201
executed:202
stock:203
ideas:204
pitched:205
bottom-up:206
approach:207
accumulated:208
sustainable:209
economic:210
moats:211
trustworthy:212
reasonable:213
valuation:214
high:215
conversion:216
rate:217
free:218
cash:219
flow:220
consistent:221
roic:222
business/market:223
cycles:224
engaged:225
extensive:226
potential:227
opportunities:228
in-depth:229
primary:230
chain:231
executive:232
market:233
surveys:234
industry:235
trade:236
shows:237
expert:238
networks:239
proprietary:240
tracking:241
tools:242
built:243
maintained:244
detailed:245
models:246
emphasis:247
unit:248
economies:249
earnings:250
quality:251
generation:252
derive:253
valuations:254
monitored:255
portfolio:256
holdings:257
recommended:258
trading:259
actions:260
sizing:261
optimal:262
allocation:263
enhance:264
assisted:265
manager:266
trained:267
mentored:268
junior:269
e.i:270
sturdza:271
long/short:272
equity:273
hedge:274
geneva-based:275
group:276
closed:277
2014-2015:278
actively:279
generated:280
sectors:281
amounting:282
kong/china:283
taiwan:284
japan:285
korea:286
australia:287
developed:288
understanding:289
specific:290
attributes:291
incentives:292
key:293
parties:294
distributors:295
institutional:296
investors:297
competitors:298
deep:299
dive:300
prepared:301
presented:302
cases:303
committee:304
proactively:305
communicated:306
sector/company:307
views:308
news:309
won:310
1st:311
place:312
managers:313
analysts:314
mock:315
competition:316
pitching:317
long:318
blackmores:319
kose:320
short:321
sansung:322
life:323
science:324
realized:325
aggregate:326
gain:327
31.94:328
july:329
september:330
bloomberg:331
l.p.:332
capital:333
2013-2014:334
created:335
customized:336
templates:337
indices:338
analysis:339
purposes:340
supported:341
buy-side:342
sales:343
timely:344
tailored:345
solutions:346
consistently:347
ranked:348
top:349
performer:350
pacific:351
region:352
received:353
distinguished:354
rating:355
standard:356
seeded:357
consortium:358
independent:359
gps:360
greater:361
china:362
conducted:363
business:364
target:365
comprising:366
candidates:367
successfully:368
acquiring:369
important:370
partners:371
raising:372
total:373
amount:374
usd:375
million:376
beijing:377
2009-2012:378
st.:379
louis:380
usa:381
washington:382
bachelor:383
administration:384
2005-2008:385
relevant:386
coursework:387
accounting:388
markets:389
statistics:390
economics:391
awards:392
thomas:393
eliot:394
scholar:395
charlotte:396
moger:397
scholarship:398
recipient:399
skills:400
interests:401
language:402
chinese:403
qualifications:404
sfc:405
type:406
licensed:407
advanced:408
user:409
api:410
cfa:411
level:412
iii:413
candidate:414
mentoring:415
reading:416
professional:417
latin:418
dance:419
foo:420
nyuk:421
min:422
address:423
blk:424
821:425
10-626:426
yishun:427
street:428
singapore:429
760821:430
emai:431
nyukmin.foo:432
mobi:433
+65:434
9223-1826:435
15th:436
april:437
1989:438
nat:439
ional:440
ity:441
singaporean:442
2009:443
singa:444
ins:445
titute:446
anagement:447
unive:448
ndo:449
b.sc:450
eco:451
nomics:452
geme:453
citco:454
ice:455
acco:456
unta:457
prese:458
calc:459
ulate:460
net:461
asse:462
lue:463
lloca:464
ted:465
ing:466
suppo:467
otcs:468
lis:469
sec:470
ies:471
unte:472
rpar:473
bloombe:474
ident:475
ify:476
rge:477
var:478
nces:479
repare:480
ily:481
repor:482
monitor:483
book:484
cap:485
ita:486
veme:487
nts:488
subscr:489
ipt:490
ns/:491
redemp:492
lia:493
ise:494
internat:495
lie:496
ther:497
globa:498
ffic:499
nsure:500
form:501
lua:502
lys:503
arra:504
instrume:505
suc:506
uit:507
opt:508
swaps:509
ope:510
ratio:511
analys:512
senio:513
rat:514
ana:515
feb:516
preparat:517
trades:518
reco:519
iat:520
ime:521
nner:522
accorda:523
nce:524
req:525
uireme:526
inve:527
igated:528
reso:529
lved:530
breaks:531
thro:532
ugh:533
thoro:534
in-:535
xeo:536
data:537
broke:538
sta:539
teme:540
itco:541
ffices:542
teams:543
ffec:544
ive:545
lve:546
issues:547
suppor:548
n-board:549
ass:550
isted:551
tra:552
fer:553
xis:554
ensured:555
correc:556
flow-:557
tabase:558
nua:559
ings:560
fers:561
/accrua:562
mentor:563
teammate:564
pro:565
uppo:566
ntrac:567
jul:568
project:569
invo:570
lveme:571
vasco:572
igra:573
corpo:574
lves:575
mining:576
targe:577
matc:578
hing:579
files:580
nning:581
proce:582
ispa:583
toke:584
llow:585
iva:586
nera:587
repo:588
rts:589
forma:590
migrat:591
comp:592
tus:593
prob:594
lem:595
lving:596
corporate:597
lecommun:598
icat:599
des:600
igned:601
fere:602
yme:603
temp:604
tes:605
system:606
jobsdb:607
arke:608
indep:609
nde:610
appro:611
hed:612
rketed:613
nys:614
prod:615
uct:616
grow:617
ase:618
compa:619
mana:620
ged:621
ustomers:622
tabases:623
inta:624
goodwill:625
rete:626
rates:627
starhub:628
pte:629
exe:630
cutive:631
2010:632
front:633
line:634
servic:635
tome:636
whic:637
unders:638
uir:639
requireme:640
vis:641
ingly:642
pat:643
lec:644
ucts:645
mos:646
ilo:647
red:648
dec:649
nationa:650
centre:651
ient:652
sociate:653
ised:654
lic:655
hea:656
lthcare:657
inst:658
itut:659
make:660
cer:661
eds:662
prompt:663
docto:664
vided:665
tte:666
nsulta:667
co-curricular:668
activities:669
representat:670
council:671
ent:672
publicity:673
treasurer:674
led:675
fina:676
ulo:677
nsact:678
prope:679
unted:680
xpe:681
nse:682
worked:683
res:684
idea:685
rod:686
promo:687
ande:688
rson:689
unio:690
col:691
wushu:692
treasure:693
school:694
repre:695
sentat:696
2006:697
2008:698
lub:699
nsured:700
act:701
ims:702
imp:703
leme:704
nted:705
unts:706
tha:707
consc:708
record:709
repres:710
lle:711
ind:712
ivid:713
lly:714
inter-schoo:715
llec:716
pers:717
vera:718
gir:719
awa:720
rded:721
3rd:722
lac:723
class:724
subject:725
camp:726
facilitator:727
isseminat:728
sse:729
stud:730
mater:731
lass:732
made:733
certa:734
impo:735
rta:736
ssa:737
ges:738
yed:739
swift:740
acc:741
urate:742
art:743
ipa:744
orga:745
nisa:746
fac:747
ilitat:748
3-day:749
hildre:750
stude:751
care:752
rvice:753
arning:754
rojec:755
socia:756
lat:757
inum:758
computer:759
fic:760
roso:761
exce:762
powerpo:763
int:764
ffice:765
uiva:766
benjamin:767
lim:768
xiang:769
254:770
serangoon:771
central:772
drive:773
03-213:774
550254:775
benji:776
lmx10:777
+65-82000353:778
https:779
//sg.linkedin.com/pub/benjamin-lim-min-xiang/76/210/857:780
funds:781
otc:782
derivatives:783
futures:784
forwards:785
options:786
capable:787
positions:788
reconciliations:789
asset:790
instruments:791
bonds:792
equities:793
highly:794
skilled:795
facilitate:796
processes:797
possess:798
operational:799
knowledge:800
geneva:801
tradar:802
paxus:803
software:804
setup:805
placement:806
memorandum:807
ppm:808
review:809
team-player:810
strong:811
passion:812
learning:813
teaching:814
experiences:815
swiss-asia:816
inancial:817
ltd.:818
ops:819
operations:820
prepare:821
summaries:822
price:823
verification:824
reconciliation:825
liaison:826
prime:827
brokers:828
custodians:829
administrators:830
auditors:831
lawyers:832
confirm:833
nav:834
figures:835
in-house:836
break:837
resolution:838
ensure:839
settlement:840
projection:841
sufficient:842
funding:843
handle:844
daily:845
including:846
expense:847
disbursement:848
booking:849
complex:850
assist:851
preparation:852
annual:853
meeting:854
deadline:855
perform:856
kyc:857
proper:858
documenting:859
board:860
resolutions:861
minutes:862
monthly:863
fact:864
sheets:865
investor:866
relations:867
involve:868
continual:869
streamlining:870
existing:871
operating:872
citibank:873
alternative:874
outsourced:875
simpler:876
baus:877
offshore:878
cost:879
manpower:880
savings:881
creating:882
capacity:883
newer:884
profitable:885
involved:886
massive:887
migration/conversion:888
aum:889
size:890
600m:891
pioneered:892
automation:893
fast:894
growing:895
pressure:896
added:897
infrastructures:898
improvement:899
macro:900
achieve:901
productivity:902
responsible:903
work-flow:904
reviews:905
mitigate:906
unnecessary:907
risks:908
counterparty:909
apr:910
page:911
managed:912
counterparts:913
deliverable:914
strictly:915
compliant:916
sla:917
soc1:918
requirements:919
resolve:920
trades/corporate:921
discrepancies:922
fostered:923
cordial:924
relationship:925
effectively:926
applied:927
skill:928
keyboard:929
shortcuts:930
2sigma:931
dymon:932
accurate:933
feedback:934
local:935
offices:936
open:937
items:938
improved:939
efficiency:940
reducing:941
time-taken:942
personal:943
functions:944
cross-trained:945
team-mates:946
heavily-traded:947
dealt:948
vanilla:949
securities:950
analyzed:951
pricing:952
migrations:953
london:954
international:955
programmes:956
honours:957
academic:958
achievement:959
letter:960
commendation:961
diploma:962
biotechnology:963
certificate:964
spinnovex:965
2007:966
exhibition:967
timpoh:968
chan:969
403d:970
25-155:971
fernvale:972
lane:973
794403:974
9109:975
7888:976
chantimpoh:977
profile:978
years:979
human:980
resource:981
support:982
self-motivated:983
energetic:984
player:985
acumen:986
excellent:987
analytical:988
interpersonal:989
goal-oriented:990
individual:991
leadership:992
abilities:993
proven:994
ability:995
staff:996
levels:997
degree:998
1998:999
national:1000
computational:1001
programming:1002
applications:1003
stpm:1004
1993:1005
sekolah:1006
menengah:1007
datok:1008
lokman:1009
erp:1010
navision:1011
sage:1012
accpac:1013
ver5.4:1014
tally:1015
point-of-sales:1016
pos:1017
infogenesis:1018
epoint:1019
wincor:1020
nixdorf:1021
payroll:1022
prosoft:1023
u4p:1024
analytics:1025
reporting:1026
bar:1027
adv:1028
access:1029
database:1030
nus:1031
colours:1032
silver:1033
vhr:1034
employment:1035
masterclass:1036
ccis:1037
bizsafe:1038
development:1039
program:1040
sbf:1041
workshop:1042
drafting:1043
employee:1044
handbook:1045
injury:1046
compensation:1047
discipline:1048
workplace:1049
legal:1050
perspective:1051
references:1052
freddie:1053
heng:1054
ex-director:1055
menu:1056
9879:1057
8826:1058
freddieheng:1059
wong:1060
managing:1061
director:1062
databit:1063
9488:1064
4143:1065
ckw:1066
databit.com.sg:1067
controller:1068
stovve:1069
fka:1070
peranakan:1071
foods:1072
2016:1073
reports:1074
manage:1075
day-to-day:1076
month-end:1077
closing:1078
coordinate:1079
auditor:1080
yearly:1081
matters:1082
develop:1083
implement:1084
policies:1085
internal:1086
control:1087
plan:1088
holistic:1089
include:1090
kitchen:1091
production:1092
food:1093
junction:1094
2014:1095
cfo:1096
auric:1097
sgx:1098
lead:1099
forecasting:1100
consolidation:1101
supervise:1102
provide:1103
employees:1104
guidance:1105
prioritization:1106
delegation:1107
assignments:1108
achievements:1109
coordinated:1110
mis:1111
consultants:1112
dollars:1113
scale:1114
integration:1115
modules:1116
leasing:1117
procurement:1118
inventory:1119
interface:1120
malaysia:1121
entities:1122
time:1123
150,000:1124
result:1125
implemented:1126
cash-flow:1127
30+:1128
overseas:1129
resulted:1130
efficient:1131
admin:1132
mar:1133
brewerkz:1134
2003:1135
2001:1136
2000:1137
executives:1138
oversee:1139
benefits:1140
insurance:1141
submission:1142
income:1143
returns:1144
cpf:1145
leave:1146
regulatory:1147
compliance:1148
budgeting:1149
year-end:1150
auditing:1151
external:1152
on-site:1153
supports:1154
retail:1155
systems:1156
network:1157
equipment:1158
servers:1159
end-user:1160
pcs:1161
outlets:1162
chartered:1163
online:1164
solution:1165
suppliers:1166
house:1167
late:1168
reduced:1169
hassle:1170
issuing:1171
hundreds:1172
cheque:1173
manually:1174
month:1175
fully:1176
integrated:1177
ordering:1178
8,000:1179
subscription:1180
party:1181
vendor:1182
early:1183
2011.:1184
single:1185
opening:1186
outlet:1187
paying:1188
setup/implementation:1189
fee:1190
36,000:1191
6,000:1192
site:1193
supporting:1194
hanjin:1195
shipping:1196
jan1999:1197
collection:1198
agent:1199
dept:1200
cummunity:1201
occupationa:1202
family:1203
medicine|:1204
july1998:1205
1999:1206
months:1207
contract:1208
lecture:1209
medical:1210
survey:1211
assignment:1212
claire:1213
shen:1214
frm:1215
contact:1216
information:1217
nanshenclaire:1218
cellular:1219
9811:1220
8195:1221
linkedin:1222
//hk.linkedin.com/in/claireshennan:1223
25c:1224
tower:1225
beach:1226
hoi:1227
fai:1228
road:1229
tai:1230
kok:1231
tsui:1232
msc:1233
cgpa:1234
3.39:1235
4.00:1236
2004:1237
city:1238
exams:1239
current:1240
holder:1241
license:1242
charter:1243
january:1244
risk:1245
june:1246
anbang:1247
sector:1248
focus:1249
financials:1250
participated:1251
groups:1252
strategic:1253
completed:1254
identified:1255
targets:1256
soe:1257
joint:1258
based:1259
fundamentals:1260
considerations:1261
carried:1262
distressed:1263
concluded:1264
adjusted:1265
evaluating:1266
ipos:1267
evaluated:1268
required:1269
established:1270
fundamental:1271
factor:1272
screening:1273
framework:1274
*on:1275
maternity:1276
august:1277
fair:1278
property:1279
consumers:1280
driven:1281
philosophy:1282
reversion:1283
centered:1284
formed:1285
systematic:1286
picking:1287
process:1288
pairs:1289
strategies:1290
companys:1291
model:1292
recorded:1293
22.9:1294
hang:1295
seng:1296
index:1297
dropped:1298
20.0:1299
gained:1300
chinas:1301
covering:1302
developers:1303
identify:1304
longer:1305
term:1306
opportunit:1307
building:1308
demographic:1309
profiles:1310
ities:1311
citic:1312
learned:1313
european:1314
germany:1315
france:1316
italy:1317
spain:1318
supervision:1319
economist:1320
alexis:1321
garatti:1322
duties:1323
luded:1324
country:1325
databases:1326
maintaining:1327
updating:1328
account:1329
comments:1330
release:1331
indicators:1332
hot:1333
spot:1334
topics:1335
authored:1336
euro:1337
zone:1338
section:1339
citics:1340
global:1341
report:1342
interpreting:1343
recent:1344
justifying:1345
forecasts:1346
gdp:1347
inflation:1348
labor:1349
monetary:1350
solid:1351
financ:1352
ial:1353
modeling:1354
assisting:1355
kylie:1356
kwok:1357
coverage:1358
responsibilities:1359
included:1360
conducting:1361
sensitivity:1362
keeping:1363
close:1364
track:1365
estimating:1366
impacts:1367
spec:1368
ific:1369
multiple:1370
tasks:1371
attention:1372
details:1373
tight:1374
schedule:1375
training:1376
modelling:1377
cient:1378
factset:1379
ceic:1380
option:1381
incorporating:1382
vba:1383
proficiency:1384
toefl:1385
test:1386
score:1387
97th:1388
percentile:1389
fluent:1390
sia:1391
edith:1392
s_edith86:1393
hotmail.com:1394
86131901:1395
ernst:1396
young:1397
llp:1398
nov:1399
2010-feb:1400
specialize:1401
banking:1402
includes:1403
audits:1404
foreign:1405
commercial:1406
intermediaries:1407
coordinating:1408
multi-location:1409
monitoring:1410
progress:1411
assess:1412
effectiveness:1413
controls:1414
determining:1415
strategy:1416
testing:1417
techniques:1418
accordance:1419
applicable:1420
ifrs/gaap:1421
advice:1422
practices:1423
verify:1424
mas:1425
institutions:1426
value-added:1427
identifying:1428
exposed:1429
recommending:1430
agreed-upon:1431
engagements:1432
regulators:1433
promote:1434
conduct:1435
focusing:1436
methodology:1437
dealing:1438
regulator:1439
performed:1440
consolidated:1441
kpmg:1442
associate:1443
aug2009-nov2010:1444
evaluation:1445
surrounding:1446
final:1447
fieldwork:1448
firms:1449
jun2008:1450
november2008:1451
attachment:1452
manufacturing:1453
holding:1454
plantation:1455
precision:1456
dormant:1457
association:1458
acca:1459
award:1460
prize:1461
paper:1462
2.4:1463
multimedia:1464
mmu:1465
honors:1466
3.93:1467
deans:1468
list:1469
year:1470
2005:1471
membership:1472
acca-:1473
accountants-:1474
isca:1475
languages:1476
reuters:1477
terminal:1478
words:1479
writing:1480
standards:1481
spoken:1482
written:1483
malay:1484
zubair:1485
imran:1486
dubai:1487
uae:1488
0502447961:1489
mob:1490
zubair3110:1491
outlook.com:1492
rounded:1493
wealth:1494
advisory:1495
depth:1496
products:1497
debt:1498
re-structuring:1499
specialise:1500
developing:1501
lasting:1502
relationships:1503
stakeholders:1504
win:1505
british:1506
married:1507
urdu:1508
hindi:1509
nationality:1510
marital:1511
status:1512
fifty:1513
head:1514
middle:1515
east:1516
establish:1517
sources:1518
oman:1519
qatar:1520
bahrain:1521
saudi:1522
b2b:1523
b2b2c:1524
suitable:1525
acquire:1526
trends:1527
follow:1528
quotations:1529
proposals:1530
tenders:1531
renewals:1532
terms:1533
negotiate:1534
contracts:1535
budgets:1536
improve:1537
unprofitable:1538
solve:1539
problems:1540
conflicts:1541
related:1542
payments:1543
sessions:1544
order:1545
increase:1546
negotiation:1547
point:1548
adcb:1549
abu:1550
dhabi:1551
assets:1552
60mm:1553
increasing:1554
35mm:1555
100:1556
hnw:1557
portfolios:1558
500k:1559
aligned:1560
c-level:1561
directors:1562
decision:1563
makers:1564
large:1565
multinational:1566
organisations:1567
understand:1568
worth:1569
liabilities:1570
build:1571
encourage:1572
repeat:1573
loans:1574
casa:1575
advised:1576
face:1577
awarded:1578
psb:1579
advisor:1580
40mm:1581
increased:1582
10mm:1583
250:1584
tailor:1585
retirement:1586
trusts:1587
mortgages:1588
specialist:1589
advising:1590
recommend:1591
find:1592
meet:1593
assessed:1594
goals:1595
gap:1596
match:1597
analysed:1598
legacy:1599
real:1600
base:1601
referrals:1602
networking:1603
cold:1604
calling:1605
citisolutions:1606
sell:1607
rapport:1608
customers:1609
displays:1610
confident:1611
assertive:1612
style:1613
succeed:1614
anticipate:1615
suggest:1616
workable:1617
regulated:1618
environment:1619
fsa:1620
core:1621
decision-making:1622
marketing:1623
distribution:1624
studies:1625
middlesex:1626
cii:1627
introduction:1628
cisi:1629
request:1630
2006-2008:1631
1987-1991:1632
1985-1987:1633
curriculum:1634
vitae:1635
hung:1636
colia:1637
29/f.:1638
block:1639
shun:1640
tsuen:1641
n.t:1642
coliaho:1643
9308:1644
8387:1645
date:1646
availability:1647
immediately:1648
educations:1649
master:1650
governance:1651
hawaii:1652
manoa:1653
honolulu:1654
lai:1655
king:1656
catholic:1657
secondary:1658
graduated:1659
passes:1660
advance:1661
examination:1662
subjects:1663
history:1664
geography:1665
period:1666
employer:1667
11/12-:1668
05/17:1669
corp.:1670
provider:1671
~hk:1672
400,000/annum:1673
reason:1674
leaving:1675
06/11-:1676
08/12:1677
lee:1678
health:1679
01/11-:1680
04/11:1681
job:1682
description:1683
secretary:1684
spectrum:1685
dissolution:1686
legalization:1687
enquiries:1688
law:1689
staffs:1690
named:1691
interim:1692
day:1693
disclosure:1694
forms:1695
submitted:1696
hkex:1697
registrar:1698
printer:1699
persons:1700
setting:1701
comprehensive:1702
liaise:1703
juniors:1704
trainees:1705
statutory:1706
advise:1707
update:1708
assistants:1709
09/08-:1710
03/10:1711
04/05-:1712
09/08:1713
05/02-:1714
04/05:1715
michael:1716
cheuk:1717
kee:1718
irm:1719
beauty:1720
intl:1721
salon:1722
05/00-:1723
wisers:1724
03/02:1725
aggregator:1726
layoff:1727
great:1728
chintech:1729
engineering:1730
11/98-:1731
10/99:1732
lighting:1733
audio:1734
video:1735
electronic:1736
projects:1737
chairmans:1738
social:1739
books:1740
records:1741
shop:1742
reception:1743
beauticians:1744
personnel:1745
ceo:1746
fields:1747
task:1748
presentation:1749
materials:1750
clerical:1751
co-ordinate:1752
book-keeping:1753
petty:1754
06/96-:1755
victory:1756
motors:1757
10/98:1758
left-hand:1759
vehicle:1760
secretary/:1761
ipo:1762
03/93-:1763
4/96:1764
capitalizing:1765
01/92-:1766
gerber:1767
inc.:1768
12/92:1769
co-ordinator:1770
rough:1771
agenda:1772
2009-current:1773
secretaries:1774
acs:1775
acis:1776
speaker:1777
putonghua:1778
ritten:1779
good:1780
csa:1781
lotus:1782
note:1783
application:1784
intranet:1785
internet:1786
typing:1787
wpm:1788
character:1789
mature:1790
flexible:1791
well-organized:1792
pleasant:1793
hard:1794
36,000~40,000/month:1795
phua:1796
ting:1797
particulars:1798
nric:1799
s8815916j:1800
117:1801
jurong:1802
ivory:1803
heights:1804
21-143:1805
600117:1806
birth:1807
1988:1808
race:1809
number:1810
9178-9716:1811
phualiting:1812
career:1813
aspirations:1814
dynamic:1815
role:1816
motivates:1817
enables:1818
realize:1819
summer:1820
exchange:1821
obtained:1822
credit:1823
module:1824
college:1825
gce:1826
distinctions:1827
alpha:1828
quarterly:1829
discussions:1830
projected:1831
cashflows:1832
closely:1833
acquisition:1834
frequent:1835
conference:1836
calls:1837
accountability:1838
multi-currencies:1839
alt:1840
e-commerce:1841
owner:1842
goods:1843
oversea-chinese:1844
corporation:1845
secured:1846
lending:1847
home:1848
product:1849
dashboard:1850
packages:1851
ground:1852
implementation:1853
queries:1854
creation:1855
calculators:1856
parts:1857
ocbcs:1858
customer-facing:1859
charge:1860
incentive:1861
schemes:1862
profitability:1863
mortgage:1864
loan:1865
overseeing:1866
end:1867
cycle:1868
assessment:1869
specialists:1870
post:1871
approval:1872
workflow:1873
produced:1874
departments:1875
newsletter:1876
residential:1877
launched:1878
promotions:1879
conceptualized:1880
ways:1881
penetration:1882
packaging:1883
campaign:1884
mechanics:1885
promotion:1886
challenge:1887
campaigns:1888
technicalities:1889
on-the-ground:1890
personally:1891
securing:1892
housing:1893
customer:1894
retention:1895
interviewed:1896
revamp:1897
documentation:1898
tool:1899
reduce:1900
wasted:1901
re-works:1902
reviewed:1903
introduced:1904
improvements:1905
initial:1906
offering:1907
bumitama:1908
agri:1909
jakarta:1910
indonesian:1911
gaap:1912
frs:1913
listing:1914
prospectus:1915
proof:1916
engagement:1917
start:1918
coming:1919
interactions:1920
directly:1921
timeline:1922
deliverables:1923
significant:1924
developments:1925
findings:1926
performance:1927
recommendations:1928
field:1929
rsm:1930
chio:1931
stone:1932
forest:1933
intern:1934
attached:1935
small:1936
medium:1937
enterprises:1938
takes:1939
industries:1940
confidence:1941
direct:1942
valuable:1943
practical:1944
putting:1945
learnt:1946
turn:1947
achieving:1948
computations:1949
schedules:1950
fixed:1951
generate:1952
computation:1953
studied:1954
insights:1955
basis:1956
taxation:1957
ranging:1958
organisational:1959
sheares:1960
hall:1961
celebrations:1962
directed:1963
event:1964
residents:1965
alumni:1966
searched:1967
sponsors:1968
likes:1969
exxonmobil:1970
action:1971
sponsorships:1972
link:1973
in-charge:1974
organised:1975
oversaw:1976
appreciation:1977
dinner:1978
seniors:1979
farewell:1980
involving:1981
500:1982
acted:1983
committees:1984
integral:1985
formation:1986
alumni-students:1987
bond:1988
logistical:1989
demands:1990
safety:1991
welfare:1992
night:1993
cycling:1994
skills/hobbies:1995
visual:1996
basics:1997
certification:1998
icpas:1999
hobbies:2000
swimming:2001
jogging:2002
outdoor:2003
participates:2004
sports:2005
events:2006
sundown:2007
marathon:2008
run:2009
cancer:2010
ocbc:2011
nanyang:2012
technological:2013
graduation:2014
hwa:2015
chong:2016
rank:2017
points:2018
math:2019
biology:2020
chemistry:2021
chij:2022
nicholas:2023
girls:2024
internship:2025
coordination:2026
mas634:2027
facilitated:2028
walkthrough:2029
owners:2030
latest:2031
outsourcing:2032
guidelines:2033
released:2034
27th:2035
employed:2036
compiled:2037
server:2038
logs:2039
authentication:2040
failed:2041
log-ons:2042
follow-up:2043
weekly:2044
updated:2045
critical:2046
incident:2047
issue:2048
reported:2049
determine:2050
reportablet:2051
message:2052
delay:2053
summarizing:2054
security:2055
continuity:2056
bcp:2057
disaster:2058
recovery:2059
visit:2060
work-from-home:2061
call-tree:2062
facilitating:2063
call:2064
tree:2065
simulated:2066
disaser:2067
scenario:2068
designated:2069
audit/security:2070
attended:2071
workshops:2072
elearning:2073
courses:2074
anti-money:2075
laundering:2076
anti-bribery:2077
seminars:2078
trends/issues:2079
fintech:2080
banyan:2081
finance/accounts:2082
documented:2083
trees:2084
g/l:2085
detail:2086
speaking:2087
accountants:2088
drew:2089
flowcharts:2090
end-to-end:2091
explanation:2092
invoice:2093
claims:2094
encountered:2095
proposed:2096
tan:2097
handled:2098
jobs:2099
smes:2100
charities:2101
non-profit:2102
organizations:2103
audited:2104
adjustments:2105
larger:2106
seah:2107
hsiao:2108
wei:2109
96717339:2110
hsiaowei.seah:2111
ncss:2112
examined:2113
appeals:2114
ngos:2115
requesting:2116
aid:2117
resources:2118
supervisor:2119
generating:2120
recording:2121
insight:2122
aspect:2123
appeal:2124
mechanism:2125
operation:2126
smile:2127
chapter:2128
organized:2129
charity:2130
raise:2131
awareness:2132
headed:2133
evolucion:2134
concert:2135
raffles:2136
institution:2137
collaboration:2138
sought:2139
corporations:2140
fund-raising:2141
leader:2142
carnival:2143
orchard:2144
scape:2145
teach:2146
reach:2147
3-month:2148
tutoring:2149
students:2150
edgefield:2151
volunteers:2152
planned:2153
schools:2154
under-privileged:2155
struggling:2156
cope:2157
schoolwork:2158
girl:2159
guides:2160
patrol:2161
gold:2162
2nd:2163
coy:2164
puan:2165
noor:2166
aishah:2167
campfire:2168
logistics:2169
community:2170
involvement/:2171
extra-curricular:2172
taekwondo:2173
club:2174
active:2175
inter-jc:2176
competitions:2177
volunteer:2178
muscular:2179
dystrophy:2180
mdas:2181
events/activities:2182
learn:2183
patients:2184
carry:2185
move:2186
safely:2187
toilet:2188
assistance:2189
wheelchair:2190
disabilities:2191
volunteered:2192
youth:2193
overnight:2194
jie:2195
rainer:2196
9776:2197
7270:2198
rainer.lo:2199
credit-suisse.com:2200
suisse:2201
surveillance:2202
agency:2203
detect:2204
manipulation:2205
unfair:2206
treatment:2207
nice:2208
actimize:2209
smarts:2210
broker:2211
goman:2212
breakfinder:2213
draft:2214
delivery:2215
room:2216
safeguarded:2217
integrity:2218
wall:2219
mnpi:2220
barrier:2221
wall-crossing:2222
public-side:2223
pre-clearance:2224
unpublished:2225
restricted:2226
breaches:2227
insider:2228
policy:2229
apac:2230
shareholding:2231
substantial:2232
selling:2233
take-overs:2234
mergers:2235
sic:2236
desk:2237
thresholds:2238
permissible:2239
imposed:2240
restrictions:2241
limit:2242
center:2243
cgio:2244
screened:2245
flags:2246
promoted:2247
pertinent:2248
scored:2249
644:2250
transparency:2251
pediatric:2252
child:2253
comparable:2254
devised:2255
impact:2256
measurement:2257
methodologies:2258
grc:2259
cmfas:2260
cacs:2261
b.b.a:2262
double:2263
specialization:2264
nasa:2265
enhanced:2266
xiaowei:2267
ellen:2268
wang:2269
42d:2270
xiaowei0130:2271
6762:2272
2495:2273
objective:2274
enhancement:2275
leveraging:2276
expertise:2277
ready:2278
embark:2279
09/2013:2280
04/2017:2281
briefing:2282
notes:2283
up-to-date:2284
optimize:2285
spreadsheet:2286
pivot:2287
tables:2288
higher-level:2289
preparations:2290
design:2291
tailor-made:2292
correspondence:2293
authorities:2294
deloitte:2295
touche:2296
tohmatsu:2297
06/2012:2298
08/2012:2299
allowance:2300
delivered:2301
cost-effective:2302
restructure:2303
drafted:2304
part-time:2305
cumulative:2306
3.77:2307
stream:2308
main:2309
derivative:2310
intelligence:2311
big:2312
full-time:2313
3.64:2314
semesters:2315
managerial:2316
theory:2317
scholarships:2318
mainland:2319
320,000:2320
hkd:2321
offered:2322
0.5:2323
outstanding:2324
30,000:2325
winner:2326
cima:2327
beta:2328
gamma:2329
computing:2330
thomson:2331
onesource:2332
adobe:2333
photoshop:2334
snl:2335
factiva:2336
trilingual:2337
ilets:2338
7.0:2339
certifications:2340
passed:2341
exam:2342
01/2016:2343
golden:2344
cityu:2345
union:2346
regular:2347
voluntary:2348
elderly:2349
cares:2350
editor:2351
literary:2352
festival:2353
mr.:2354
zheng:2355
chouyu:2356
co-edited:2357
salaries:2358
negotiable:2359
confidential:2360
validate:2361
rior:2362
wire:2363
platforms:2364
author:2365
izers:2366
ensuring:2367
rocessed:2368
cut:2369
adhering:2370
transfers:2371
agreements:2372
instructions:2373
thorized:2374
person:2375
call-back:2376
investigate:2377
transactions:2378
returned:2379
and/or:2380
unusual:2381
reconcile:2382
recharged:2383
spvs:2384
expenses:2385
administer:2386
facility:2387
documen:2388
tation:2389
drawdown:2390
conversion/rollover:2391
repaymen:2392
interest:2393
calculation:2394
documentations:2395
communicate:2396
collect:2397
kyc/aml:2398
checklist:2399
adher:2400
periodic:2401
dow:2402
jones:2403
world:2404
check:2405
negative:2406
rovide:2407
discounting:2408
hits:2409
mlro:2410
news/sanctions:2411
filing:2412
susp:2413
icious:2414
transaction:2415
source:2416
beneficiary:2417
liance:2418
pep:2419
fatca:2420
crs:2421
llation:2422
validation:2423
tain:2424
static:2425
investran:2426
intralinks:2427
disseminate:2428
communications:2429
relating:2430
ital:2431
notices:2432
clien:2433
onboarding:2434
remediation:2435
roject:2436
input:2437
money:2438
deal:2439
rocess:2440
missing:2441
gaps:2442
secondment:2443
guernsey:2444
streamline:2445
rocesses:2446
europe:2447
discussion:2448
heads:2449
streams:2450
managemen:2451
resume:2452
agnes:2453
low:2454
reg:2455
ion:2456
volvo:2457
gross:2458
fit:2459
margins:2460
sea:2461
marine:2462
commentaries:2463
iance:2464
rofit:2465
corrective:2466
calculate:2467
turnover/days:2468
overdue:2469
deb:2470
highlighting:2471
bad:2472
debts:2473
iper:2474
ventures:2475
venture:2476
firm:2477
investmen:2478
irr:2479
burn:2480
stocks/cash:2481
distr:2482
ibutions:2483
revalue:2484
post-valuation:2485
compute:2486
stake:2487
investee:2488
diminution:2489
irectors:2490
brokering:2491
receipts:2492
quoted:2493
stocks:2494
issuance:2495
certificates:2496
divestment:2497
subsidiaries:2498
thailand:2499
costing:2500
castrol:2501
ingapore:2502
roducts:2503
calcu:2504
lation:2505
ricing:2506
roll-up:2507
revision:2508
exercise:2509
profit:2510
margin:2511
semi-annual:2512
ith:2513
tang:2514
lin:2515
cpa:2516
small-:2517
to-med:2518
ium:2519
schedu:2520
les:2521
programs:2522
serv:2523
ices:2524
532:2525
jelapang:2526
-47:2527
670532:2528
ingle:2529
citizenship:2530
ingaporean:2531
9150:2532
7822:2533
ile:2534
agnes.ssg:2535
1995:2536
1997:2537
kent:2538
canterbury:2539
arts:2540
lower:2541
polytechn:2542
strength:2543
conversant:2544
microso:2545
outlook:2546
tralinks:2547
wor:2548
meticu:2549
lous:2550
committed:2551
recognition:2552
state:2553
peer-to-peer:2554
commitment:2555
ais:2556
tate:2557
recognize:2558
excep:2559
tional:2560
teamwork:2561
helier:2562
mourant:2563
exceptional:2564
serving:2565
carloo:2566
16/f:2567
yee:2568
court:2569
124b:2570
argyle:2571
mongkok:2572
kowloon:2573
9839:2574
6266:2575
carloong3:2576
//hk.linkedin.com/in/carloong:2577
summary:2578
exposure:2579
fofs:2580
mandatory:2581
provident:2582
mpf:2583
reliable:2584
millennium:2585
subsidiary:2586
mcp:2587
largest:2588
asia-pacific:2589
administrated:2590
500m:2591
aml:2592
subscriptions:2593
redemptions:2594
special:2595
downloaded:2596
prices:2597
uploaded:2598
re-registration:2599
non-managerial:2600
colleague:2601
manual:2602
participate:2603
formulas:2604
speed:2605
1/2:2606
fax:2607
covers:2608
original:2609
20mins/cover:2610
10mins/cover:2611
pension:2612
principal:2613
founded:2614
1879:2615
nyse:2616
pfg:2617
fortune:2618
500.:2619
100m:2620
employers:2621
mncs:2622
fis:2623
processed:2624
orso:2625
enrollments:2626
contributions:2627
terminations:2628
distributions:2629
in/out:2630
japanese:2631
occasionally:2632
study:2633
consulting:2634
administrative:2635
hku:2636
continuing:2637
space:2638
postgraduate:2639
shue:2640
yan:2641
hksyu:2642
b.a:2643
upper:2644
honor:2645
pui:2646
ching:2647
pcms:2648
additional:2649
inter-college:2650
christian:2651
fellowship:2652
vice:2653
president:2654
league:2655
microfinance:2656
inal:2657
v-look:2658
html:2659
self-learning:2660
50wpm:2661
40wpm:2662
baozekun133cwhitleyroad:2663
whitleyresidences:2664
singapore297654+6591195908:2665
zekun.b.zk:2666
gmail.comeducationandcertificationnationaluniversityofsingapore:2667
nusbusinessschoolaug2012jun2016bachelorinbusinessadministration:2668
accountingandfinance:2669
secondupperhonours2013/14semester1deanslist:2670
top5:2671
ofcohort:2672
cfainstitutedec2014presentpassedcfalevel1and2onfirstattempt:2673
cfalevel3candidatebloomberginstitutefeb2015feb2015placedin99thpercentileofalltest-takersforbloombergaptitudetestandenteredapactop5halloffamehecmontral:2674
canada:2675
studentexchangeprogram:2676
jan2014may2014nusstudyabroadscholarship:2677
givenforstrongacademicandleadershipqualities:2678
professionalexperiencemizuhobankjul2016presentglobalgraduateprogramanalystimprovedfcfofusd10millionforaclientbystructuringareversefactoringprogram.directlyengagedinclientmeetingstostructuresolutionstotheirfinancingneeds.conductedduediligenceonworkingcapitalnoteinvestmentviadouble-truststructure.createdresearchreportontheoutlookofpalmoil:2679
bulkshippingandthermalcoalindustriesintheapacregion.provideddailymarketupdateonkeyclientsandtradingcommodities.royalbankofcanadawealthmanagementasiamay2015jul2015summerintern:2680
investmentsandproductsproducedtrainingmaterialsacrossclassesofinvestmentproductsfortheeducationofrelationshipmanagers.amendedproductfactsheetsonstructurednotes:2681
fixedincomeandforexproducts.createdproductfactsheetoncontingentconvertiblenotes:2682
cocos:2683
.performedpay-outanalysisonstructuredproducts:2684
suchasequitylinkednotes:2685
sharknotes:2686
andsteepenerstructurednotes.learntprocessoftradeexecutionforbondsandforexproducts.updatedpolicypaperonsecuritizeddualcurrencyinvestmentsforinvestmentproductcommittee.unitedoverseasbankmay2014jul2014summerintern:2687
grouptechnologyandoperationsanalysedoutwardtelegraphictransferprocessandproposedusingmedianresultinsteadofmeanresultforevaluativepurposesduetoextremedatapoints.thisenhancedaccuracyofsystemevaluations.statisticallyanalysedtransactionvolumefordifferentproducttypesandproposedareasoffocusforenhancement.proposedimprovementstotheauthenticationoftransactionstoreduceprocessingtimeandreduceoperatingcosts.ubsag:2688
may2013aug2013summerintern:2689
privatewealthmanagement:2690
valuebasedinvestment:2691
draftedportfolioestablishmentrulesandmonitoringcriteriabasedoncustomizedinvestmentportfoliosmirroringsocialimpactfunds.analysedinvestmentviabilityofachineseenterpriseinbeijingforalargeclientandprovidedinputswhichledtorejectionoftheinvestmentduetoriskfactors.contributedineditingaubswhitepaperpublishedattheboaoforumforasia2013.reachedouttolocalbusinessleaderstoparticipateinaworkshopforultra-highnetworthclientsintheasia-pacificregion.translatedclientprospectusandforregionalofficesfromenglishtomandarin.otherrelatedexperience/co-curricularactivitiesstocktrackportfoliomanagementsimulationcompetitionjan2014mar2014pickedstocksthatgeneratedover10:2692
inaweekusingtopdownapproach.nus-shellcasechallengesep2013sep2013performedpreliminaryvaluationofthemulti-nationalenergycompanypetrobras.analysedindustryoutlookfortheoilandgasindustry.skillsfastleanerandstrongteamplayerwithexcellentinterpersonalskillsfinancialmodellingandbasicexcelvba:2693
+85261323838:2694
sackvilleleung_2001:2695
__________________________________________________________________________________________:2696
leungsikwaisackville:2697
personalsummary:2698
experiencedinvariousfinancialfieldsincludingpersonalfinance:2699
transactionalbanking:2700
assetmanagementandfundmanagement:2701
withlegaltraining:2702
workexperienceinlegaldocumentationandclientfacing:2703
strategicplanningandstrategyimplementation:2704
interested:2705
areas:2706
policyandclientfacingwithinstitutionalclients:2707
aspiration:2708
workexperience:2709
inhouseparalegal:2710
statestreetglobaladvisors:2711
asiaexjapan:2712
requirement:2713
segregated:2714
legaldocumentssuchasnotices:2715
consentletter:2716
imaamendmentsandnovations:2717
negotiated:2718
providers:2719
custodiansandotherparties:2720
assistedinanrfpwithacpiclientwithhkd500millionmandatesanddraftedatailor:2721
madeima:2722
handledprospectusamendmentandfilingsforetfslistedinsingaporeandhongkong:2723
handledterminationofaprivatefund:2724
secretarialmatters:2725
filings:2726
reviewedandamendedconstitutionaldocumentsofentitiesofthecompany:2727
assistedtheheadoflegalonstructuralchangesincompliancewiththesfcmicregime:2728
anddoddfrankact:2729
assistedinansfcinquiryoffundperformance:2730
preparemonthlyregulatoryupdateandconductrelevantresearch:2731
providersforcostevaluationprogramme:2732
memos:2733
subsidiariesintwoapaccountries:2734
3,000+:2735
naming:2736
convention:2737
databasegloballyadoptedbytheregion:2738
createdadatabaseofimaclausesanddocumentationrequiredforeachaccount:2739
dec2016topresent:2740
legaldraftingand:2741
fundmanagement:2742
compliace:2743
apr2015tonov2016:2744
aviationandship:2745
yachttransaction:2746
bilateraland:2747
syndicatedloans:2748
paralegal:2749
bankingandfinance:2750
stephensonharwood:2751
salesandleaseback:2752
cargo:2753
ships:2754
financing:2755
airplanesandothersecuredfinancingandrefinancingprojects:2756
legalopinionsandotherlegaldocuments:2757
liaised:2758
registrars:2759
ofconditionprecedents:2760
titleregistrationandregistrationofsecuritydocuments:2761
draftedthedocumentsrequiredforthesaleofyachts:2762
handlinganyinquiriesfromclientsandescalatetosupervisorifrequired:2763
liaisedwiththeregistries:2764
surveyors:2765
theclientsandotherpartiesfortheregistrationof:2766
yachts:2767
handledloanssecuredbyguarantee:2768
sharecharge:2769
accountcharge:2770
draftedrequireddocumentsfortheloans:2771
liaisedwithvariouspartiesoncollectionofconditionprecedents:2772
aug2010toaug2012:2773
wealthmanagementconsultant:2774
convoyfinancialserviceslimited:2775
financialplanning:2776
managedfundinvestmentportfoliosofhkd10millions:2777
covered:2778
commodities:2779
regions:2780
includingglobalemergingnewmarkets:2781
brics:2782
japanandamerica:2783
jurisdoctor:2784
theuniversityofhongkong:2785
2ndclasshonour:2786
sept2010tojul2012:2787
bachelorofsocialsciences:2788
1stclasshonour:2789
sept2007tojul2010:2790
sept2009tojan2010:2791
exchangestudent:2792
nationalchengchiuniversityoftaiwan:2793
languageandskills:2794
businessproficient:2795
microsoftoffice:2796
computerskills:2797
legalproficientinword:2798
businessproficientinexcel:2799
adobeacrobatpro:2800
legalproficient:2801
charmaine:2802
charmaine-swl:2803
live.com.sg:2804
//www.linkedin.com/in/charmaine-seah-791209105/:2805
+65-92322120:2806
passionate:2807
conscientious:2808
assurance:2809
adept:2810
implementing:2811
complementing:2812
kon:2813
sept:2814
not-for-profit:2815
organisation:2816
fees:2817
54,500:2818
till:2819
completion:2820
stage:2821
freight:2822
forwarding:2823
salient:2824
features:2825
tested:2826
completing:2827
walk-throughs:2828
associates:2829
interns:2830
appraisal:2831
exceeds:2832
expectations:2833
2016.:2834
represented:2835
games:2836
darts:2837
badminton:2838
organization:2839
tests:2840
reportable:2841
deficiencies:2842
noted:2843
investigated:2844
actual:2845
results:2846
businesses:2847
toshiba:2848
payable:2849
bills:2850
allocated:2851
respective:2852
centres:2853
verified:2854
supplier:2855
issued:2856
subsequently:2857
mtu:2858
suzhou:2859
distinction:2860
selected:2861
represent:2862
prestigious:2863
journal:2864
entries:2865
accustomed:2866
fast-paced:2867
culture:2868
american:2869
billings:2870
aca:2871
england:2872
wales:2873
icaew:2874
pursuing:2875
competent:2876
suite:2877
sap:2878
caseware:2879
kinds:2880
lau:2881
sheung:2882
sheyla:2883
1103:2884
11/f:2885
yat:2886
sin:2887
6462:2888
9681:2889
sheylalaups:2890
translation:2891
interpretation:2892
spanish:2893
leung:2894
kuk:2895
no.1:2896
w.h:2897
cheung:2898
hkale:2899
chin:2900
hkcee:2901
equivalent:2902
eng:2903
mathematics:2904
principle:2905
kclg:2906
complying:2907
pilot:2908
publishing:2909
freelance:2910
translator:2911
translated:2912
population:2913
census:2914
enumerator:2915
visits:2916
editorial:2917
verse:2918
participant:2919
hkiaat:2920
case:2921
accredited:2922
technicians:2923
cross:2924
yu64:2925
elementary:2926
13,200:2927
one-month:2928
notification:2929
16,000:2930
liwei:2931
grace:2932
tanliweigrace:2933
dob:2934
1994:2935
92205341:2936
chempaka:2937
avenue:2938
s349625:2939
kings:2940
anatomy:2941
physiology:2942
pass:2943
11-:2944
humanities:2945
simply:2946
connect:2947
enterprise:2948
administrator:2949
orders:2950
web-database:2951
netiquette:2952
accuracy:2953
phone:2954
emails:2955
liase:2956
deliveries:2957
create:2958
force:2959
vehicles:2960
partnership:2961
partnerships:2962
e-front:2963
checks:2964
correct:2965
exposures:2966
manifold:2967
demanding:2968
clientele:2969
completeness:2970
receiving:2971
bowling:2972
vice-captain:2973
runners-up:2974
sunig:2975
organise:2976
bonding:2977
teacher-in-charge:2978
transportation:2979
tournaments:2980
well-being:2981
inter-school:2982
division:2983
tenpin:2984
championships:2985
skills/other:2986
mandar:2987
awards/scholarship:2988
merit:2989
barker:2990
2011-2012:2991
two-month:2992
notice:2993
ngai_123:2994
ngai:2995
yuen:2996
kenneth:2997
9759:2998
5768:2999
52,000:3000
55,000:3001
mnc:3002
nominated:3003
seconded:3004
deloittes:3005
pn21:3006
familiar:3007
hkfrs:3008
hkgaap:3009
rules:3010
communication:3011
tianli:3012
code:3013
advisers:3014
professionals:3015
accurately:3016
products/:3017
formulate:3018
respond:3019
inquiries:3020
proceeds:3021
lender:3022
ifrs:3023
us-sox:3024
j-sox:3025
material:3026
misstatements:3027
arranged:3028
colleagues:3029
experts:3030
forecast:3031
liquidity:3032
disposal:3033
replied:3034
second-tier:3035
started:3036
non-accounting:3037
frontpage:3038
flexsystem:3039
kingdee:3040
yonyou:3041
acl:3042
sql:3043
matlab:3044
tableaup:3045
java:3046
c++:3047
dreamweaver:3048
flash:3049
dfdfdfdfdfdfdf:3050
fdfd:3051
vanessa:3052
yeung:3053
cell:3054
852-5696-3332:3055
vanessa.yeung33:3056
situations:3057
goldman:3058
sachs:3059
analyze:3060
pipeline:3061
maximize:3062
earning:3063
balance:3064
sheet:3065
metrics:3066
deals:3067
acquisitions:3068
southeast:3069
aspects:3070
financial/valuation/operational/regulatory/tax:3071
spv:3072
entity:3073
rationalization:3074
regime:3075
enforced:3076
u.s.:3077
bank-holding:3078
optimizing:3079
reduction:3080
preferred:3081
shares:3082
buyback:3083
commerzbank:3084
benefit:3085
on-call:3086
york:3087
rated:3088
nationally:3089
practice:3090
350:3091
people:3092
join:3093
technical:3094
undergoing:3095
transformation:3096
high-pressure:3097
prior:3098
banking/private:3099
regulation:3100
document:3101
purchase:3102
corning:3103
samsung:3104
spin-offs:3105
constituents:3106
advisors:3107
deliver:3108
deadlines:3109
divestiture:3110
assessing:3111
scope:3112
carve-out:3113
pro-forma:3114
projections:3115
expedite:3116
constant:3117
analyses:3118
300m:3119
sale:3120
sealed:3121
air:3122
packing:3123
buyer:3124
updates:3125
resolved:3126
buyers:3127
normalize:3128
ebitda:3129
1.2b:3130
hess:3131
energy:3132
impacting:3133
separately:3134
marketings:3135
stand-alone:3136
helped:3137
750m:3138
caterpillar:3139
platinum:3140
differences:3141
200m:3142
off-balance-sheet:3143
item:3144
first-time:3145
bidders:3146
commerce:3147
toronto:3148
cum:3149
laude:3150
arct:3151
piano:3152
royal:3153
conservatory:3154
music:3155
summa:3156
u.s.a.:3157
shanghainese:3158
involvement:3159
womens:3160
developer:3161
viking:3162
dragon:3163
boat:3164
toastmasters:3165
nyc:3166
diversity:3167
inclusiveness:3168
flexibility:3169
dif:3170
coordinator:3171
2013-:3172
ascend:3173
regional:3174
shan:3175
susan:3176
miss:3177
age:3178
living:3179
district:3180
tsing:3181
852:3182
9201:3183
3887:3184
su_susanchan:3185
equiom:3186
hsbc:3187
probate:3188
philanthropy:3189
plans:3190
proposing:3191
wha:3192
a.f:3193
t.n:3194
lui:3195
co.:3196
wus:3197
heating:3198
conditioning:3199
compose:3200
letters:3201
correspondences:3202
incoming:3203
polyu:3204
northumbria:3205
unn:3206
united:3207
kingdom:3208
higher:3209
vocational:3210
processing:3211
hkd40,000.00:3212
2-month:3213
ben:3214
accoutant:3215
allocations:3216
accrual:3217
versus:3218
activity:3219
hoc:3220
positive:3221
consistency:3222
client/other:3223
capture:3224
counter:3225
confirmations:3226
verifying:3227
enhancements:3228
anglo:3229
eastern:3230
shipmanagement:3231
vessel:3232
accruals:3233
portage:3234
comparing:3235
variance:3236
budget:3237
charged:3238
vessels:3239
improving:3240
creativity:3241
numerous:3242
import:3243
summit:3244
port:3245
website:3246
declaration:3247
bsc:3248
units:3249
sim:3250
unified:3251
uec:3252
yong:3253
peng:3254
johor:3255
travel:3256
purpose:3257
2011-:3258
yue:3259
chen:3260
mrics:3261
26/f:3262
capitol:3263
lohas:3264
park:3265
tseung:3266
kwan:3267
+852-5984-5968:3268
jojochen217:3269
land:3270
outbound:3271
feasibility:3272
sourcing:3273
proposal:3274
coupon:3275
3-year:3276
usd400:3277
3.875:3278
introducing:3279
sino-ocean:3280
kkr:3281
invest:3282
dtz:3283
cushman:3284
wakefield:3285
october:3286
propose:3287
employing:3288
dcf:3289
capitalization:3290
